// See https://aka.ms/new-console-template for more information
Console.WriteLine("Hello, World!");
//Напишите программу, которая задаёт массив из N элементов (из диапазона [0-14] )
// и выводит на экран десятичное представление числа, записанного в СС 
//по основанию 15

//N: 3 [9, 4, 12] => 2097

//Создание массива
//Заполнение числами от 1 до 14
//Печать массива
//Написать конвертор из 15-й системы счисления в 10-ю.


System.Console.WriteLine(MyLibrary.ToDec(new int[]{9,4,12}));




