// See https://aka.ms/new-console-template for more information
//Console.WriteLine("Hello, World!");

//Задача 10.
//Напишите программу,которая принимает на вход трехзначное число 
// и на выходе показывает вторую цифру этого числа.

int a = 589 ;
System.Console.WriteLine((a / 10) % 10);
